ssh -p 2010 root@mai-mini-internet.u-strasbg.fr
cde5205baa206fb3



conf t
mpls ldp
router-id 10.158.0.1
address-family ipv4
discovery transport-address 10.158.0.1
interface port_PE5
exit
exit
exit
exit
exit
exit

mise en place des vpn

sur PE1

conf t
router bgp 10
address-family ipv4 vpn
neighbor 10.155.0.1 activate
neighbor 10.158.0.1 activate


idem sur les autres vpn X 




sur PE1 container pour VPN X


link add VRF_X type vrf table 10
link set VRF_X up
link set port_CE1 master VRF_X

sur CE1 

conf t
ip route 172.16.0.0/12 10.0.13.2

sur PE1

conf t
ip route 172.16.10.0/24 10.0.13.1 vrf VRF_X

sur le PE1 :

PE1_router#conf t
PE1_router(config)# router bgp 10 vrf VRF_X
PE1_router(config-router)# address-family ipv4
PE1_router(config-router-af)# redistribute static
PE1_router(config-router-af)# label vpn export auto
PE1_router(config-router-af)# rd vpn export 10:100   	
PE1_router(config-router-af)# rt vpn both 10:100	
PE1_router(config-router-af)# export vpn
PE1_router(config-router-af)# import vpn



pour les VPN Y

PE1_router(config-router-af)# rd vpn export 10:200
PE1_router(config-router-af)# rt vpn both 10:200

_____________________________________________________________________

Pour avoir tous les points utiliser les commandes ospf sur le vpn

Pour PE3 par exemple :

PE3_router# conf t
PE3_router(config)# router ospf vrf VRF_X
PE3_router(config-router)# network 10.0.15.0/24 area 0

CE3_router# conf t
CE3_router(config)# router ospf
CE3_router(config-router)# network 10.0.15.0/24 area 0

ici cela permet que le /24 de l host puisse etre vu par pe3


CE3_router# conf t
CE3_router(config)# router ospf
CE3_router(config-router)# network 172.17.10.0/24 area 0
CE3_router(config-router)# network 192.168.10.3/32 area 0

PE3_router# conf t
PE3_router(config)# router bgp 10 vrf VRF_X
PE3_router(config-router)# address-family ipv4
PE3_router(config-router-af)# redistribute ospf
PE3_router(config-router-af)# label vpn export auto
PE3_router(config-router-af)# rd vpn export 10:100
PE3_router(config-router-af)# rt vpn both 10:100
PE3_router(config-router-af)# export vpn
PE3_router(config-router-af)# import vpn


Pour les VPN Y en ospf

PE3_router(config-router-af)# rd vpn export 10:200
PE3_router(config-router-af)# rt vpn both 10:200

PE3_router# conf t
PE3_router(config)# router ospf vrf VRF_X
PE3_router(config-router)# network 172.17.10.0/24 area 0
PE3_router(config-router)# redistribute bgp

ici on redistribue bgp sur ospf



___________________________________________________________________


il faut clean : il faut réduire le full mesh ibgp 
	il faut réduire à un seul voisin : PE5
	
	
hub and spoke :


déploiement de base : 

seul voisinage vpn vers le hub
	donc un seul neigboor activate sur les vpn vers le hub
hub en voisinage avec tout le monde

on a both 10:100 pour le moment 
on veut 

sur les vpn

export 100
import 10

sur le hub 

export 10
import 100

si on passe le hub en rr

router reflector -client 
 et il faut changer les politique d import et d export 




































